/* Search criteria for other date properties of a file, such as when a photograph was taken, within a specific period before today */
"%@ %[Any Date]@" = "%1$@ %2$[Qualquer Data]@";
"%@ %[Today]@" = "%1$@ %2$[Hoje]@";
"%@ %[Since Yesterday]@" = "%1$@ %2$[Desde Ontem]@";
"%@ %[This week]@" = "%1$@ %2$[Esta semana]@";
"%@ %[Within Last 2 weeks]@" = "%1$@ %2$[Nas Últimas 2 semanas]@";
"%@ %[This month]@" = "%1$@ %2$[Este mês]@";
"%@ %[Within Last 2 months]@" = "%1$@ %2$[Nos Últimos 2 meses]@";

/* Search criteria for other boolean properties of a file, such as whether red-eye correction was on */
"%@ %[Any]@" = "%1$@ %2$[Qualquer]@";
"%@ %[Yes]@" = "%1$@ %2$[Sim]@";
"%@ %[No]@" = "%1$@ %2$[Não]@";

/* Search criteria for other string properties of a file, such as the name of the author */
"%@ %[Contains]@ %@" = "%1$@ %2$[Contém]@ %3$@";
"%@ %[Begins With]@ %@" = "%1$@ %2$[Começa Com]@ %3$@";
"%@ %[Ends With]@ %@" = "%1$@ %2$[Termina com]@ %3$@";
"%@ %[Is]@ %@" = "%1$@ %2$[É]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, on a specific date */
"%@ %[Exactly]@ %@" = "%1$@ %2$[Exatamente]@ %3$@";
"%@ %[Before]@ %@" = "%1$@ %2$[Antes]@ %3$@";
"%@ %[After]@ %@" = "%1$@ %2$[Após]@ %3$@";

/* Search criteria for other numerical properties of a file, such as the pixel height of an image */
"%@ %[Greater than]@ %@" = "%1$@ %2$[Maior que]@ %3$@";
"%@ %[Less than]@ %@" = "%1$@ %2$[Menor que]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, within a user-specified period of time before today */
"%@ %[Within Last]@ %@ %[Days]@" = "%1$@ %2$[Nos Últimos]@ %3$@ %4$[Dias]@";
"%@ %[Within Last]@ %@ %[Weeks]@" = "%1$@ %2$[Nas Últimas]@ %3$@ %4$[Semanas]@";
"%@ %[Within Last]@ %@ %[Months]@" = "%1$@ %2$[Nos Últimos]@ %3$@ %4$[Meses]@";
"%@ %[Within Last]@ %@ %[Years]@" = "%1$@ %2$[Nos Últimos]@ %3$@ %4$[Anos]@";

/* Search criteria for other color space properties of a file */
"%[Color Space]@ %[Any Color Space]@" = "%1$[Espaço de Cor]@ %2$[Qualquer Espaço de Cor]@";
"%[Color Space]@ %[RGB]@" = "%1$[Espaço de Cor]@ %2$[RGB]@";
"%[Color Space]@ %[CMYK]@" = "%1$[Espaço de Cor]@ %2$[CMYK]@";
"%[Color Space]@ %[Grayscale]@" = "%1$[Espaço de Cor]@ %2$[Escala de Cinza]@";

/* Search criteria for files by contents */
"%[Contents]@ contain %@" = "%1$[Conteúdo]@ contém %2$@";

/* Search criteria for time duration - minutes and seconds */
"%[Duration]@ %[Greater than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Duração]@ %2$[Maior que]@ %3$@ %4$[min]@ %5$@ %6$[seg]@";
"%[Duration]@ %[Less than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Duração]@ %2$[Menor que]@ %3$@ %4$[min]@ %5$@ %6$[seg]@";

/* Search criteria for files by keyword */
"%[Keywords]@ %@" = "%1$[Palavras-chave]@ %2$@";

/* Search criteria for files by keyword containing */
"%[Keywords]@ contain %@" = "%1$[Palavras-chave]@ contém %2$@";

/* Search criteria for specific kinds of files */
"%[Kind]@ is %[Any]@" = "%1$[Tipo]@ é %2$[Qualquer]@";
"%[Kind]@ is %[Images]@" = "%1$[Tipo]@ é %2$[Imagens]@";
"%[Kind]@ is %[Text]@" = "%1$[Tipo]@ é %2$[Texto]@";
"%[Kind]@ is %[PDF]@" = "%1$[Tipo]@ é %2$[PDF]@";
"%[Kind]@ is %[Movies]@" = "%1$[Tipo]@ é %2$[Filmes]@";
"%[Kind]@ is %[Music]@" = "%1$[Tipo]@ é %2$[Música]@";
"%[Kind]@ is %[Documents]@" = "%1$[Tipo]@ é %2$[Documentos]@";
"%[Kind]@ is %[Presentations]@" = "%1$[Tipo]@ é %2$[Apresentações]@";
"%[Kind]@ is %[Folders]@" = "%1$[Tipo]@ é %2$[Pastas]@";
"%[Kind]@ is %[Applications]@" = "%1$[Tipo]@ é %2$[Aplicativos]@";

/* Search criteria for other kinds of files */
"%[Kind]@ is %[Others...]@ %@" = "%1$[Tipo]@ é %2$[Outros...]@ %3$@";

/* Search criteria for files by a particular label (color) */
"%[Label]@ is %@" = "%1$[Etiqueta]@ é %2$@";

/* Search criteria for dates a fixed amount relative to today */
"%[Last Opened]@ %[Any Date]@" = "%1$[Última Abertura]@ %2$[Qualquer Data]@";
"%[Last Modified]@ %[Any Date]@" = "%1$[Última Modificação]@ %2$[Qualquer Data]@";
"%[Created]@ %[Any Date]@" = "%1$[Criado]@ %2$[Qualquer Data]@";
"%[Last Opened]@ %[Today]@" = "%1$[Última Abertura]@ %2$[Hoje]@";
"%[Last Modified]@ %[Today]@" = "%1$[Última Modificação]@ %2$[Hoje]@";
"%[Created]@ %[Today]@" = "%1$[Criado]@ %2$[Hoje]@";
"%[Last Opened]@ %[Since Yesterday]@" = "%1$[Última Abertura]@ %2$[Desde Ontem]@";
"%[Last Modified]@ %[Since Yesterday]@" = "%1$[Última Modificação]@ %2$[Desde Ontem]@";
"%[Created]@ %[Since Yesterday]@" = "%1$[Criado]@ %2$[Desde Ontem]@";
"%[Last Opened]@ %[This week]@" = "%1$[Última Abertura]@ %2$[Esta semana]@";
"%[Last Modified]@ %[This week]@" = "%1$[Última Modificação]@ %2$[Esta semana]@";
"%[Created]@ %[This week]@" = "%1$[Criado]@ %2$[Esta semana]@";
"%[Last Opened]@ %[Within Last 2 weeks]@" = "%1$[Última Abertura]@ %2$[Nas Últimas 2 semanas]@";
"%[Last Modified]@ %[Within Last 2 weeks]@" = "%1$[Última Modificação]@ %2$[Nas Últimas 2 semanas]@";
"%[Created]@ %[Within Last 2 weeks]@" = "%1$[Criado]@ %2$[Nas Últimas 2 semanas]@";
"%[Last Opened]@ %[This month]@" = "%1$[Última Abertura]@ %2$[Este mês]@";
"%[Last Modified]@ %[This month]@" = "%1$[Última Modificação]@ %2$[Este mês]@";
"%[Created]@ %[This month]@" = "%1$[Criado]@ %2$[Este mês]@";
"%[Last Opened]@ %[Within Last 2 months]@" = "%1$[Última Abertura]@ %2$[Nos Últimos 2 meses]@";
"%[Last Modified]@ %[Within Last 2 months]@" = "%1$[Última Modificação]@ %2$[Nos Últimos 2 meses]@";
"%[Created]@ %[Within Last 2 months]@" = "%1$[Criado]@ %2$[Nos Últimos 2 meses]@";

/* Search criteria for specific dates */
"%[Last Opened]@ %[Exactly]@ %@" = "%1$[Última Abertura]@ %2$[Exatamente]@ %3$@";
"%[Last Modified]@ %[Exactly]@ %@" = "%1$[Última Modificação]@ %2$[Exatamente]@ %3$@";
"%[Created]@ %[Exactly]@ %@" = "%1$[Criado]@ %2$[Exatamente]@ %3$@";
"%[Last Opened]@ %[Before]@ %@" = "%1$[Última Abertura]@ %2$[Antes de]@ %3$@";
"%[Last Modified]@ %[Before]@ %@" = "%1$[Última Modificação]@ %2$[Antes de]@ %3$@";
"%[Created]@ %[Before]@ %@" = "%1$[Criado]@ %2$[Antes de]@ %3$@";
"%[Last Opened]@ %[After]@ %@" = "%1$[Última Abertura]@ %2$[Após]@ %3$@";
"%[Last Modified]@ %[After]@ %@" = "%1$[Última Modifcação]@ %2$[Após]@ %3$@";
"%[Created]@ %[After]@ %@" = "%1$[Criado]@ %2$[Após]@ %3$@";

/* Search criteria for dates a variable amount relative to today */
"%[Last Opened]@ %[Within Last]@ %@ %[Days]@" = "%1$[Última Abertura]@ %2$[Nos Últimos]@ %3$@ %4$[Dias]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Days]@" = "%1$[Última Modificação]@ %2$[Nos Últimos]@ %3$@ %4$[Dias]@";
"%[Created]@ %[Within Last]@ %@ %[Days]@" = "%1$[Criado]@ %2$[Nos Últimos]@ %3$@ %4$[Dias]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Última Abertura]@ %2$[Nas Últimas]@ %3$@ %4$[Semanas]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Última Modificação]@ %2$[Nas Últimas]@ %3$@ %4$[Semanas]@";
"%[Created]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Criado]@ %2$[Nas Últimas]@ %3$@ %4$[Semanas]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Months]@" = "%1$[Última Abertura]@ %2$[Nos Últimos]@ %3$@ %4$[Meses]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Months]@" = "%1$[Última Modificação]@ %2$[Nos Últimos]@ %3$@ %4$[Meses]@";
"%[Created]@ %[Within Last]@ %@ %[Months]@" = "%1$[Criado]@ %2$[Nos Últimos]@ %3$@ %4$[Meses]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Years]@" = "%1$[Última Abertura]@ %2$[Nos Últimos]@ %3$@ %4$[Anos]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Years]@" = "%1$[Última Modificação]@ %2$[Nos Últimos]@ %3$@ %4$[Anos]@";
"%[Created]@ %[Within Last]@ %@ %[Years]@" = "%1$[Criado]@ %2$[Nos Últimos]@ %3$@ %4$[Anos]@";

/* Search criteria for musical genre type */
"%[Musical genre]@ %@" = "%1$[Gênero musical]@ %2$@";

/* Search criteria for name extension type */
"%[Name Extension]@ %@" = "%1$[Extensão do Nome]@ %2$@";

/* Search criteria for files by name */
"%[Name]@ %[Contains]@ %@" = "%1$[Nome]@ %2$[Contém]@ %3$@";
"%[Name]@ %[Begins With]@ %@" = "%1$[Nome]@ %2$[Começa Por]@ %3$@";
"%[Name]@ %[Ends With]@ %@" = "%1$[Nome]@ %2$[Termina Com]@ %3$@";
"%[Name]@ %[Is]@ %@" = "%1$[Nome]@ %2$[Is]@ %3$@";

/* Search criteria for other color space properties of a file */
"%[Orientation]@ %[Any Orientation]@" = "%1$[Orientação]@ %2$[Qualquer Orientação]@";
"%[Orientation]@ %[Landscape]@" = "%1$[Orientação]@ %2$[Horizontal]@";
"%[Orientation]@ %[Portrait]@" = "%1$[Orientação]@ %2$[Vertical]@";

/* Menu item to bring up an additional list of search criteria */
"%[Other...]@" = "%[Outros...]@";

/* Search criteria for raw query type */
"%[Raw query]@ %@" = "%1$[Pergunta simples]@ %2$@";

/* Search criteria for generic search-by-all-fields type */
"%[Search for]@ %@" = "%1$[Buscar]@ %2$@";

/* Search criteria for files larger or smaller than a specific number of kilobytes, megabytes, or gigabytes */
"%[Size]@ %[Greater than]@ %@ %[KB]@" = "%1$[Tamanho]@ %2$[Maior que]@ %3$@ %4$[KB]@";
"%[Size]@ %[Less than]@ %@ %[KB]@" = "%1$[Tamanho]@ %2$[Menor que]@ %3$@ %4$[KB]@";
"%[Size]@ %[Greater than]@ %@ %[MB]@" = "%1$[Tamanho]@ %2$[Maior que]@ %3$@ %4$[MB]@";
"%[Size]@ %[Less than]@ %@ %[MB]@" = "%1$[Tamanho]@ %2$[Menor que]@ %3$@ %4$[MB]@";
"%[Size]@ %[Greater than]@ %@ %[GB]@" = "%1$[Tamanho]@ %2$[Maior que]@ %3$@ %4$[GB]@";
"%[Size]@ %[Less than]@ %@ %[GB]@" = "%1$[Tamanho]@ %2$[Menor que]@ %3$@ %4$[GB]@";

/* Search criteria for other visibility properties of a file */
"%[Visibility]@ %[Visible or Invisible]@" = "%1$[Visibilidade]@ %2$[Visível ou Invisível]@";
"%[Visibility]@ %[Visible Items]@" = "%1$[Visibilidade]@ %2$[Itens Visíveis]@";
"%[Visibility]@ %[Invisible Items]@" = "%1$[Visibilidade]@ %2$[Itens Invisíveis]@";

